{
	"No workspace folders are open. Please open a workspace folder to use this extension": "No hay carpetas de espacio de trabajo abiertas. Abra una carpeta de espacio de trabajo para usar esta extensión",
	"Select a workspace folder to use. This folder will be used to load workspace-specific configuration for the extension": "Selecciona una carpeta de espacio de trabajo para usar. Esta carpeta se utilizará para cargar la configuración específica del espacio de trabajo para la extensión",
	"Welcome to {0} version {1}! The extension is now active": "¡Bienvenido a {0} versión {1}! La extensión ahora está activa",
	"New version of {0} is available. Check out the release notes for version {1}": "Hay disponible una nueva versión de {0}. Consulte las notas de la versión {1}",
	"Release Notes": "Notas de la versión",
	"Close": "Cerrar",
  "No text editor is active!": "¡No hay editor de texto activo!",
  "The file has not been created!": "¡El archivo no ha sido creado!",
  "Successfully created the file!": "¡Archivo creado con éxito!",
  "Name already exist!": "¡El nombre ya existe!",
  "No module file found, skipping auto-import!": "¡No se encontró el archivo de módulo, se omite la importación automática!",
  "Auto-imported of {0} into '{1}' is successfully!": "La importación automática de {0} en '{1}' se realizó con éxito!",
  "Error occurred while auto-importing: {0}": "Se produjo un error al importar automáticamente: {0}",
  "ORM annotations not found for {0}": "Anotaciones ORM no encontradas para {0}",
  "No text is selected!": "¡No hay texto seleccionado!",
  "Invalid JSON Schema!": "¡Esquema JSON inválido!",
  "About Us": "Acerca de Nosotros",
  "Report Issues": "Reportar Problemas",
  "Rate Us": "Calificanos",
  "Support Us": "Apóyanos",
  "Become a Sponsor": "Conviértete en Patrocinador",
  "Donate via PayPal": "Donar a través de PayPal",
  "Although {0} is offered at no cost, your support is deeply appreciated if you find it beneficial. Thank you for considering!": "Aunque {0} se ofrece sin costo, su apoyo es muy apreciado si lo encuentra beneficioso. ¡Gracias por considerarlo!",
  "Enter the folder name": "Ingrese el nombre de la carpeta",
  "Enter the class name": "Ingrese el nombre de la clase",
  "Enter the type name": "Ingrese el nombre del tipo",
  "Enter the controller name": "Ingrese el nombre del controlador",
  "Enter the decorator name": "Ingrese el nombre del decorador",
  "Enter the Dto class name": "Ingrese el nombre de la clase Dto",
  "Enter the exception filter name": "Ingrese el nombre del filtro de excepción",
  "Enter the exception class name": "Ingrese el nombre de la clase de excepción",
  "Enter the filter class name": "Ingrese el nombre de la clase de filtro",
  "Enter the gateway class name": "Ingrese el nombre de la clase de gateway",
  "Enter the guard class name": "Ingrese el nombre de la clase de guardia",
  "Enter the interceptor class name": "Ingrese el nombre de la clase de interceptor",
  "Enter the interface class name": "Ingrese el nombre de la clase de interfaz",
  "Enter the interface type": "Ingrese el tipo de interfaz",
  "Enter the jwt guard class name": "Ingrese el nombre de la clase de guardia jwt",
  "Enter the logger class name": "Ingrese el nombre de la clase de registro",
  "Enter the middleware class name": "Ingrese el nombre de la clase de middleware",
  "Enter the module class name": "Ingrese el nombre de la clase de módulo",
  "Enter the pipe class name": "Ingrese el nombre de la clase de tubería",
  "Enter the provider class name": "Ingrese el nombre de la clase de proveedor",
  "Enter the resolver class name": "Ingrese el nombre de la clase de resolución",
  "Enter the service class name": "Ingrese el nombre de la clase de servicio",
  "Enter the test class name": "Ingrese el nombre de la clase de prueba",
  "Enter library name": "Ingrese el nombre de la biblioteca",
  "Enter sub-app name": "Ingrese el nombre de la subaplicación",
  "Select the options for the controller generation (optional)": "Seleccione las opciones para la generación del controlador (opcional)",
  "Select the options for the gateway generation (optional)": "Seleccione las opciones para la generación de la puerta de enlace (opcional)",
  "Select the options for the library generation (optional)": "Seleccione las opciones para la generación de la biblioteca (opcional)",
  "Select the options for the module generation (optional)": "Seleccione las opciones para la generación del módulo (opcional)",
  "Select the options for the provider generation (optional)": "Seleccione las opciones para la generación del proveedor (opcional)",
  "Select the options for the resolver generation (optional)": "Seleccione las opciones para la generación del resolutor (opcional)",
  "Select the options for the resource generation (optional)": "Seleccione las opciones para la generación de recursos (opcional)",
  "Select the options for the service generation (optional)": "Seleccione las opciones para la generación del servicio (opcional)",
  "Select the options for the sub-app generation (optional)": "Seleccione las opciones para la generación de la subaplicación (opcional)",
  "Select the template for the custom element generation": "Seleccione la plantilla para la generación del elemento personalizado"
}
